import { ipv46RegExp } from './ip'

export const ValidationMatch = {
  uid: {
    regExp: /^[0-9]{11}$/,
    message: 'uid 必须为 11 位字符串',
  },
  username: {
    regExp: /^[\u4e00-\u9fa5a-zA-Z0-9_-]{2,16}$/,
    message: '用户名支持2-16个中英文、数字、下划线或短横线字符',
  },
  email: {
    regExp: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
    message: '邮箱格式错误',
  },
  simpleUsername: {
    regExp: /^(?:\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*|[\u4e00-\u9fa5a-zA-Z0-9._-]{2,16})$/,
    message: '用户名支持最少2-16个字符，包括中英文、数字、减号、下划线或点号，或者邮箱格式',
  },
  nickname: {
    regExp: /^[\u4e00-\u9fa5a-zA-Z0-9_-]{2,16}$/,
    message: '昵称仅支持最少2-16个字符，包括中英文、数字、减号或下划线',
  },
  account: {
    // 匹配：邮箱 | 手机号 | 传统用户名(6-16位字母数字下划线短横线)
    regExp: /^(?:\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*|1[3-9]\d{9}|[a-zA-Z0-9-_]{6,16})$/,
    message: '用户名应为邮箱/手机号/英文字母，数字，下划线或者短横线组成，并且用户名长度为 6~16 位',
  },
  mongodbId: {
    regExp: /^[a-fA-F0-9]{24}$/,
    message: '格式错误',
  },
  password: {
    regExp: /^[\w!@#$%^&*()\-+=<>?.,:;"'~`\[\]{}|\\\/]{6,40}$/,
    message: '密码长度为6-40位，可以包含数字、字母、下划线及特殊字符',
  },
  code4: {
    regExp: /^[a-zA-Z0-9]{4}$/,
    message: '验证码格式错误',
  },
  code6: {
    regExp: /^[a-zA-Z0-9]{6}$/,
    message: '验证码格式错误',
  },
  cron: {
    regExp:
      /^(\*|([0-9]|1[0-9]|2[0-9]|3[0-9]|4[0-9]|5[0-9])|\*\/([0-9]|1[0-9]|2[0-9]|3[0-9]|4[0-9]|5[0-9])) (\*|([0-9]|1[0-9]|2[0-3])|\*\/([0-9]|1[0-9]|2[0-3])) (\*|([1-9]|1[0-9]|2[0-9]|3[0-1])|\*\/([1-9]|1[0-9]|2[0-9]|3[0-1])) (\*|([1-9]|1[0-2])|\*\/([1-9]|1[0-2])) (\*|([0-6])|\*\/([0-6]))$/,
    message: 'corn表达式错误',
  },
  ipv46: {
    regExp: ipv46RegExp,
    message: 'ip地址错误',
  },
  image: {
    regExp: /^(image\/png|image\/jpeg|image\/jpg|image\/webp)$/,
    message: '图片格式错误',
  },
}
